Revit 2027 API
PhaseArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PhaseArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As PhaseArrayIterator
public:
virtual PhaseArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> PhaseArrayIterator
override ReverseIterator : unit -> PhaseArrayIterator
Return Value
PhaseArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace